KPMG Virtual Internship 
Data Quality Assesment

In [2]:
import pandas as pd

In [3]:
df = pd.read_excel(r"C:\Users\pcolon\Desktop\KPMG\KPMG_VI_New_raw_data_update_final.xlsx")#Reading the excel sheet

In [4]:
xl = pd.ExcelFile('KPMG_VI_New_raw_data_update_final.xlsx')#method that lets me know what sheets are available
xl.sheet_names

['Title Sheet',
 'Transactions',
 'NewCustomerList',
 'CustomerDemographic',
 'CustomerAddress']

In [5]:
c_names = ['transaction_id','product_id','customer_id','transaction_date','online_order','order_status','brand','product_line','product_class','product_size','list_price','standard_cost','product_first_sold_date']
df_transactions = xl.parse('Transactions',header=None,names=c_names)

In [54]:
df_transactions.head(5)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date,price
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,1970-01-01,1702.55
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,1970-01-01,1544.61
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,1970-01-01,817.36
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,1970-01-01,1055.82
5,6,25,2339,2017-03-08,1.0,Approved,Giant Bicycles,Road,medium,medium,1538.99,829.65,1970-01-01,709.34

In [52]:
df_transactions['price']= df_transactions.list_price - df_transactions.standard_cost # creating new Price Column

In [53]:
df_transactions.price

1        1702.55
2        1544.61
3         817.36
4        1055.82
5         709.34
          ...
19995     802.26
19996     104.24
19997    1592.19
19998      91.15
19999     195.34
Name: price, Length: 19999, dtype: float64

In [7]:
df_transactions.info()
#info method usually give me a brief overview of whats going on with the data set

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

In [8]:
df_transactions = df_transactions.drop([df_transactions.index[0]])#dropped Row 0

In [9]:
df_transactions.head(5)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0
5,6,25,2339,2017-03-08,1.0,Approved,Giant Bicycles,Road,medium,medium,1538.99,829.65,39031.0

In [10]:
df_transactions.isnull().values.any()# checking for missing Values in the dataframe

True

In [11]:
df_transactions.isnull().sum()#checking exactly how many rows are missing from specific columns

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

CLEARLY  AN ISSUE WITH TIMESTAMP DATA IN THE PRODUCT_FIRST_SOLD_DATE COLUMN SO LETS FIX THAT

In [12]:
df_transactions['product_first_sold_date'] = pd.to_datetime(df_transactions['product_first_sold_date']).dt.date 
#modification of Dates

In [13]:
df_transactions.head(5)#Checking to see what I got going on !

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,1970-01-01
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,1970-01-01
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,1970-01-01
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,1970-01-01
5,6,25,2339,2017-03-08,1.0,Approved,Giant Bicycles,Road,medium,medium,1538.99,829.65,1970-01-01

In [14]:
df_transactions.describe()

,transaction_id,product_id,customer_id,online_order,list_price,standard_cost
count,19999.000000,19999.000000,19999.000000,19639.000000,19999.000000,19802.000000
mean,10001.000000,45.366818,1738.185459,0.500484,1107.881269,556.072324
std,5773.358353,30.752830,1011.940066,0.500012,582.793738,405.950208
min,2.000000,0.000000,1.000000,0.000000,12.010000,7.210000
25%,5001.500000,18.000000,857.500000,0.000000,575.270000,215.140000
50%,10001.000000,44.000000,1736.000000,1.000000,1163.890000,507.580000
75%,15000.500000,72.000000,2613.000000,1.000000,1635.300000,795.100000
max,20000.000000,100.000000,5034.000000,1.000000,2091.470000,1759.850000

In [15]:
df_transactions.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19999 entries, 1 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           19999 non-null  int64
 1   product_id               19999 non-null  int64
 2   customer_id              19999 non-null  int64
 3   transaction_date         19999 non-null  datetime64[ns]
 4   online_order             19639 non-null  float64
 5   order_status             19999 non-null  object
 6   brand                    19802 non-null  object
 7   product_line             19802 non-null  object
 8   product_class            19802 non-null  object
 9   product_size             19802 non-null  object
 10  list_price               19999 non-null  float64
 11  standard_cost            19802 non-null  float64
 12  product_first_sold_date  19802 non-null  object
dtypes: datetime64[ns](1), float64(3), int64(3), object(6)
memory usage: 2.1+ MB

In [16]:
df_transactions.columns#Checking columns to get a closer look on whats going on !

Index(['transaction_id', 'product_id', 'customer_id', 'transaction_date',
       'online_order', 'order_status', 'brand', 'product_line',
       'product_class', 'product_size', 'list_price', 'standard_cost',
       'product_first_sold_date'],
      dtype='object')

In [17]:
df_transactions['brand'].value_counts()#counting the unique values for each categorical column

Solex             4252
Giant Bicycles    3312
WeareA2B          3295
OHM Cycles        3043
Trek Bicycles     2990
Norco Bicycles    2910
Name: brand, dtype: int64

In [18]:
df_transactions['online_order'].value_counts()#.........

1.0    9829
0.0    9810
Name: online_order, dtype: int64

In [19]:
df_transactions['order_status'].value_counts()#..........

Approved     19820
Cancelled      179
Name: order_status, dtype: int64

In [20]:
duplicates = df_transactions.duplicated()#checking for duplicate Values .....
df_transactions[duplicates].sum()

transaction_id             0.0
product_id                 0.0
customer_id                0.0
transaction_date           0.0
online_order               0.0
order_status               0.0
brand                      0.0
product_line               0.0
product_class              0.0
product_size               0.0
list_price                 0.0
standard_cost              0.0
product_first_sold_date    0.0
dtype: float64

In [21]:
drop_columns = ['Unnamed: 16','Unnamed: 17','Unnamed: 18','Unnamed: 19','Unnamed: 20']

In [22]:
df_new_customers = pd.read_excel(r'C:\Users\pcolon\Desktop\KPMG\KPMG_VI_New_raw_data_update_final.xlsx', sheet_name='NewCustomerList')

This Time I just deleted the whole header by using Excel because it saved me time !Way more effecient !

In [23]:
df_new_customers.head(3)

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,...,QLD,Australia,6,0.46,0.575,0.71875,0.610938,1,1,1.71875
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,...,NSW,Australia,11,0.68,0.680,0.85000,0.722500,1,1,1.71875
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,...,VIC,Australia,5,0.93,0.930,0.93000,0.930000,1,1,1.71875

In [24]:
#df_new_customers = df_new_customers.drop(drop_columns,axis = 1)# dropping the columns that are unlabeled which were 16-20 changes made in xcel

In [25]:
df_new_customers.head(3)

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,...,QLD,Australia,6,0.46,0.575,0.71875,0.610938,1,1,1.71875
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,...,NSW,Australia,11,0.68,0.680,0.85000,0.722500,1,1,1.71875
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,...,VIC,Australia,5,0.93,0.930,0.93000,0.930000,1,1,1.71875

In [26]:
df_new_customers.describe()#Running summary Statistics

,past_3_years_bike_related_purchases,tenure,postcode,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,49.836000,11.388000,3019.227000,7.397000,0.754780,0.847850,0.952152,0.879184,498.819000,498.819000,0.881714
std,27.796686,5.037145,848.895767,2.758804,0.202037,0.247363,0.292605,0.279520,288.810997,288.810997,0.293525
min,0.000000,0.000000,2000.000000,1.000000,0.400000,0.400000,0.400000,0.340000,1.000000,1.000000,0.340000
25%,26.750000,7.000000,2209.000000,6.000000,0.580000,0.650000,0.720000,0.660000,250.000000,250.000000,0.649531
50%,51.000000,11.000000,2800.000000,8.000000,0.750000,0.840000,0.925000,0.860625,500.000000,500.000000,0.860000
75%,72.000000,15.000000,3845.500000,9.000000,0.930000,1.025000,1.162500,1.062500,750.250000,750.250000,1.075000
max,99.000000,22.000000,4879.000000,12.000000,1.100000,1.375000,1.718750,1.718750,1000.000000,1000.000000,1.718750

In [27]:
df_new_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 23 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            971 non-null    object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   DOB                                  983 non-null    datetime64[ns]
 5   job_title                            894 non-null    object
 6   job_industry_category                835 non-null    object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
 16  Unnamed: 16                          1000 non-null   float64
 17  Unnamed: 17                          1000 non-null   float64
 18  Unnamed: 18                          1000 non-null   float64
 19  Unnamed: 19                          1000 non-null   float64
 20  Unnamed: 20                          1000 non-null   int64
 21  Rank                                 1000 non-null   int64
 22  Value                                1000 non-null   float64
dtypes: datetime64[ns](1), float64(5), int64(6), object(11)
memory usage: 179.8+ KB

In [28]:
df_new_customers.isnull().sum()#checking for null values

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Unnamed: 16                              0
Unnamed: 17                              0
Unnamed: 18                              0
Unnamed: 19                              0
Unnamed: 20                              0
Rank                                     0
Value                                    0
dtype: int64

In [29]:
df_new_customers.duplicated().sum()#No duplicates

0

In [30]:
df_new_customers.columns

Index(['first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'address', 'postcode', 'state', 'country',
       'property_valuation', 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18',
       'Unnamed: 19', 'Unnamed: 20', 'Rank', 'Value'],
      dtype='object')

In [31]:
df_new_customers.gender.value_counts()

Female    513
Male      470
U          17
Name: gender, dtype: int64

WTH IS U ???? lets find out !

In [50]:
df_new_customers.gender=df_new_customers.gender.replace('U','Unspecified')

In [51]:
df_new_customers.gender.value_counts()

Female         513
Male           470
Unspecified     17
Name: gender, dtype: int64

In [34]:
 customer_data = pd.read_excel(r'C:\Users\pcolon\Desktop\KPMG\KPMG_VI_New_raw_data_update_final.xlsx', sheet_name='CustomerDemographic')

In [35]:
customer_data.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0

DEFAULT COLUMN LOOKS LIKE GARBAGE TO ME !

In [36]:
customer_data = customer_data.drop('default',axis=1)

In [37]:
customer_data.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,8.0

In [38]:
customer_data.describe()

       customer_id  past_3_years_bike_related_purchases       tenure
count  4000.000000                          4000.000000  3913.000000
mean   2000.500000                            48.890000    10.657041
std    1154.844867                            28.715005     5.660146
min       1.000000                             0.000000     1.000000
25%    1000.750000                            24.000000     6.000000
50%    2000.500000                            48.000000    11.000000
75%    3000.250000                            73.000000    15.000000
max    4000.000000                            99.000000    22.000000

LETS CHECK FOR MISSING VALUES

In [39]:
customer_data.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                  87
dtype: int64

In [40]:
customer_data.duplicated().sum()

0

In [41]:
customer_data.gender.value_counts()

Female    2037
Male      1872
U           88
M            1
F            1
Femal        1
Name: gender, dtype: int64

In [42]:
customer_data.gender = customer_data.gender.replace('F','Female').replace('M','Male').replace('Femal','Female').replace('U','Unspecified')

In [43]:
customer_data.gender.value_counts()

Female         2039
Male           1873
Unspecified      88
Name: gender, dtype: int64

In [44]:
customer_data.customer_id.iloc[-1]

4000